/*
 * Створіть клас, який дозволить виконувати моніторинг ресурсів, що використовуються програмою. 
 * Використовуйте його з метою спостереження за роботою програми, а саме: користувач може вказати 
 * прийнятні рівні споживання ресурсів (пам'яті), а методи класу дозволять видати попередження, 
 * коли кількість ресурсів, що реально використовуються, наблизитися до максимально допустимого рівня.
 */

namespace MemoryMonitor
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // Delay
            Console.WriteLine("\nPress any key to continue...");
            Console.ReadKey();
        }
    }
}
