/*
 * Створіть  консольний  додаток,  який  в  різних  потоках  зможе  отримати  доступ  до  двох  файлів.
 * Зчитайте  з  цих  файлів  їх  вміст  і  спробуйте  записати  отриману  інформацію  в  третій  файл.
 * Читання/запис повинні здійснюватися одночасно в кожному з дочірніх потоків. Використовуйте 
 * блокування потоків для того, щоб домогтися коректного запису в кінцевий файл. 
 */

namespace ReadWriteToFile
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // Delay
            Console.WriteLine("\nPress any key to continue...");
            Console.ReadKey();
        }
    }
}
